In [7]:
import numpy as np
import pandas as pd
from datetime import datetime

In [8]:
year = 1978
month = 2
day = 13
hour = 14
minute = 59
sec = 54

In [9]:
date = datetime(1978,2,13,14,minute,sec)

In [10]:
date

datetime.datetime(1978, 2, 13, 14, 59, 54)

In [11]:
date.today()

datetime.datetime(2022, 10, 23, 10, 45, 8, 80530)

In [12]:
dates = pd.Series(['Nov 3, 1990', '2000-01-01',None])

In [13]:
dates

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [15]:
times = pd.to_datetime(dates)

In [16]:
times

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [17]:
euro_date = '31-12-2000'

In [18]:
pd.to_datetime(euro_date)

C:\Users\rupak\AppData\Local\Temp\ipykernel_24268\1538865445.py:1: UserWarning: Parsing '31-12-2000' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  pd.to_datetime(euro_date)

Timestamp('2000-12-31 00:00:00')

In [19]:
euro_date_unsure = '10-12-2000'

In [21]:
pd.to_datetime(euro_date_unsure,dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [22]:
style_date = '12--Dec--2000'

In [23]:
pd.to_datetime(style_date,format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [24]:
custom_date = "12th of Dec 2000"

In [25]:
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

In [27]:
df = pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [29]:
df.head()

         DATE  MRTSSM4453USN
0  1992-01-01           1509
1  1992-02-01           1541
2  1992-03-01           1597
3  1992-04-01           1675
4  1992-05-01           1822

In [30]:
df['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [31]:
df['DATE'] = pd.to_datetime(df['DATE'])

In [32]:
df['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [35]:
df.groupby('DATE').value_counts()

DATE        MRTSSM4453USN
1992-01-01  1509             1
1992-02-01  1541             1
1992-03-01  1597             1
1992-04-01  1675             1
1992-05-01  1822             1
                            ..
2019-12-01  6630             1
2020-01-01  4388             1
2020-02-01  4533             1
2020-03-01  5562             1
2020-04-01  5207             1
Length: 340, dtype: int64

In [40]:
df = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [42]:
df['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [43]:
df = df.set_index('DATE')

In [46]:
df.resample(rule='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [48]:
df = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [50]:
df['DATE'].dt.month

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int64